Repository: GuillaumeBonnet/GuillaumeBonnet.github.io
Catalog: src/locale/messages.*.xlf
Languages: fr_fr

# about-me-title
source: About me
fr_fr: À propos de moi

# about:content
source: <p class="">I am a developer based in Lyon(France).</p><mat-divider inset class="w-2/3 mx-auto mb-6 mt-4"></mat-divider><p class=""> I've been working for the past 5 years as a <strong class="font-extrabold">full stack developer</strong > on many projects with the <a href="https://www.salesforce.com/fr/products/what-is-salesforce/" class="link" target="_blank" >Salesforce platform</a>. </p><mat-divider inset class="w-2/3 mx-auto mb-6 mt-4"></mat-divider><p class=""> This site showcases <a routerLink="/github/home" routerLinkActive="active"><strong class="font-extrabold">hobby projects</strong ></a> I did in various back-end and front-end technologies. </p><mat-divider inset class="w-2/3 mx-auto mb-6 mt-4"></mat-divider><p class=""> I am open for <a class="link" routerLink="/linked-in" routerLinkActive="active">job</a> opportunities as a <strong class="font-extrabold whitespace-nowrap" ><app-tech-icon name="typescript" class="inline-block"></app-tech-icon>TypeScript developer</strong > with <span class="whitespace-nowrap"><app-tech-icon name="angular" class="inline-block"></app-tech-icon>Angular</span>, <span class="whitespace-nowrap"><app-tech-icon name="vue" class="inline-block"></app-tech-icon>Vue.js</span> or <span class="whitespace-nowrap"><app-tech-icon name="nodejs" class="inline-block"></app-tech-icon>Node.js.</span></p>
fr_fr: <p class=""> Je suis un développeur basé sur Lyon. </p> <mat-divider inset class="w-2/3 mx-auto mb-6 mt-4"> </mat-divider> <p class=""> Je travaille depuis 5 ans en tant que <strong class="font-extrabold"> développeur full stack </strong > sur différents projets avec la <a href="https://www.salesforce.com/fr/products/what-is-salesforce/" class="link" target="_blank" > plateforme Salesforce </a> . </p> <mat-divider inset class="w-2/3 mx-auto mb-6 mt-4"> </mat-divider> <p class=""> Ce site présente mes <a routerLink="/github/home" routerLinkActive="active"> <strong class="font-extrabold"> projets passe-temps </strong > </a> faits avec différentes technologies back-end et front-end. </p> <mat-divider inset class="w-2/3 mx-auto mb-6 mt-4"> </mat-divider> <p class=""> Je suis ouvert à des opportunités de <a class="link" routerLink="/linked-in" routerLinkActive="active"> travail </a> en tant que <strong class="font-extrabold whitespace-nowrap" > développeur <app-tech-icon name="typescript" class="inline-block"> </app-tech-icon>TypeScript </strong > avec <span class="whitespace-nowrap"> <app-tech-icon name="angular" class="inline-block"> </app-tech-icon>Angular </span> <span class="whitespace-nowrap"> <app-tech-icon name="vue" class="inline-block"> </app-tech-icon>Vue.js </span> ou <span class="whitespace-nowrap"> <app-tech-icon name="nodejs" class="inline-block"> </app-tech-icon>Node.js. </span> </p>

# menu-button-arial-label
source: button with menu icon
fr_fr: bouton avec un icône de menu

source: About
fr_fr: Accueil

# freezer-practice:freezer-practice-description
source: A <strong class="font-extrabold">website</strong> for mobile only that displays freezer and aliments
fr_fr: Un <strong class="font-extrabold"> site web </strong> pour les smartphones uniquement qui affiche des réfrigérateurs et leurs aliments.

# freezer-practice:cold-start
source: The real site has a <strong>cold start</strong> because it is hosted on a free plan on heroku. It sleeps when there is no web traffic in a 30-minute period.
fr_fr: Le vrai site a un <strong> démarrage lent </strong> parce qu'il est hébergé sur une option gratuite d'heroku. Il se met en veille quand il n'y a pas de trafic web pendant 30 minutes.

# freezer-practice:demonstration-giff
source: Demonstration giff
fr_fr: Giff de démonstration

# freezer-practice:real-site-label
source: Real site in production
fr_fr: Vrai site en production

source: Features
fr_fr: Fonctionnalités

# freezer-practice:description-auth
source: <strong>Secure authentication</strong> where passwords are saved hashed.
fr_fr: <strong> Authentification sûre </strong> où les mots de passes sont sauvegardés hachés.

# freezer-practice:description-email
source: Email verification and password reset through <strong>email messages</strong>
fr_fr: Vérification d'email et changement de mot de passe fait avec des <strong> messages emails </strong>

# freezer-practice:description-content
source: Collection of <strong>freezers</strong> which each contain their own collections of <strong>aliments</strong>.
fr_fr: Liste de <strong> réfrigérateurs </strong> avec chacun leur liste d' <strong> aliments. </strong>

# freezer-practice:description-crud
source: Create, remove or edit any freezers or aliments.
fr_fr: Création, suppression ou édition de n'importe quels réfrigérateurs ou aliments.

# freezer-practice:description-icons
source: Integration of custom svg <strong>icons</strong>.
fr_fr: Intégration d' <strong> icônes </strong> svg spéciaux.

source: Technology
fr_fr: Technologie

# title-front-end
source: The plugin's front-end:
fr_fr: L'interface graphique de l'extension

# title-back-end
source: The server back-end:
fr_fr: Le serveur en back-end:

source: (typing language)
fr_fr: (langage de typage)

source: (css preprocessor)
fr_fr: (préprocesseur css)

source: (components)
fr_fr: (composants)

source: (language)
fr_fr: (langage)

source: (database)
fr_fr: (base de donnée)

source: (Hosting server platform)
fr_fr: (Plateforme hébergeuse de serveur)

# github-project:link
source: Github repository <fa-icon class="ml-2 text-xl" [icon]="faGithub"></fa-icon>
fr_fr: repository Github <fa-icon class="ml-2 text-xl" [icon]="faGithub"> </fa-icon>

# see-more-project
source: See other projects
fr_fr: Voir les autres projets

source: Meta Movie logo
fr_fr: logo de Meta Movie

# meta-movie:description
source: A browser <strong class="font-">plugin for Chrome</strong> that gives you <strong class="font-extrabold">facts</strong> on the form of text bubbles in <strong class="font-extrabold">Netflix</strong> videos
fr_fr: Une <strong class="font-"> extension de navigateur pour Chrome </strong> qui affiche des <strong class="font-extrabold"> anecdotes et commentaires </strong> avec des bulles de texte dans des vidéos <strong class="font-extrabold"> Netflix </strong>

# meta-movie:select-deck
source: On a movie/episode page you can select one of the available decks of fact cards.
fr_fr: Sur une page de film/série vous pouvez sélectionner l'un des paquets de cartes-infos disponibles.

# meta-movie:create-deck
source: To create a deck you need to log in. The passwords are hashed in database and the communications are done over Secure Https.
fr_fr: Pour créer un paquets vous devez vous connecter. Les mots de passes sont hachés en base de donnée et les communications sont encryptées sous Https.

source: (css framework)
fr_fr: (framework css)

source: (web framework)
fr_fr: (framework web)

source: (database ORM)
fr_fr: (ORM base de donnée)

# personal-site:main-title
source: This site
fr_fr: Ce site

# personal-site:description
source: A static <strong class="font-extrabold">Responsive website</strong> (mobile and desktop) hosted on github.
fr_fr: Un <strong class="font-extrabold"> site web réactif </strong> (mobiles et ordinateurs) et static hébergé sur github.

# personal-site:mobile-explanation
source: For Desktop users the mobile version of the site will be shown in a rectangle bellow.
fr_fr: Pour les utilisateurs d'ordinateurs la version mobile du site est affichée dans un rectangle en dessous.

# components-and-theme
source: (components and custom theme)
fr_fr: (composants et thème personnalisé)

# workspace-preference:description
source: Global configuration files such as git's<strong>.gitconfig</strong>, VSCode's <strong>settings.json</strong>, vscode <strong>snippets</strong> json are synchronized through the use of symbolic links and a git repository.
fr_fr: Fichiers de configuration globaux comme git's <strong> .gitconfig </strong> , VSCode's <strong> settings.json </strong> , vscode <strong> snippets </strong> json sont synchronisés avec l'aide de liens symboliques et un repository git.

source: View my profile
fr_fr: Voir mon profile

source: Main projects
fr_fr: Projets principaux

# read-more-project
source: click to see a demo, the functional, and technical breakdown <div><mat-icon>read_more</mat-icon></div>
fr_fr: cliquer pour voir une démo et les détails fonctionnels et techniques <div> <mat-icon> read_more </mat-icon> </div>

# linked-in:link-text
source: You can reach out and check out my LinkedIn page:
fr_fr: Vous pouvez me contacter et regarder ma page LinkedIn:

source: LinkedIn Link
fr_fr: Lien LinkedIn

# icon-vuejs
source: vuejs icon
fr_fr: icône de vuejs

# icon-angular
source: angular icon
fr_fr: icône d'angular

# icon-material
source: Material Design icon
fr_fr: icône de Material Design

# icon-tailwindcss
source: tailwindcss icon
fr_fr: icône de tailwindcss

# icon-java
source: java icon
fr_fr: icône de java

# icon-nodejs
source: nodejs icon
fr_fr: icône de nodejs

# icon-HEROKU
source: HEROKU icon
fr_fr: icône d'HEROKU

# icon-expressjs
source: expressjs icon
fr_fr: icône d'expressjs

# icon-typescript
source: typescript icon
fr_fr: icône de typescript

# icon-Prisma
source: Prisma icon
fr_fr: icône de Prisma

# icon-PostgreSQL
source: PostgreSQL icon
fr_fr: icône de PostgreSQL

# icon-spring
source: spring icon
fr_fr: icône de spring

# icon-sass
source: sass icon
fr_fr: icône de sass

# icon-VS-Code
source: VS Code icon
fr_fr: icône de VS Code

# icon-git
source: Git icon
fr_fr: icône de Git

# icon-powershell
source: PowerShell icon
fr_fr: icône de PowerShell

# description_meta-movie
source: A browser plugin for Chrome that gives you facts on the form of text bubbles in Netflix videos
fr_fr: Une extension de navigateur Chrome qui affiche des anecdotes et commentaires avec des bulles de texte dans des vidéos Netflix.

# description_freezer-practice
source: A website for mobile that displays freezer and aliments
fr_fr: Un site pour mobile qui affiche des réfrigérateurs et des aliments

# title_personal-site
source: This personal site
fr_fr: Ce site personnel

# description_personal-site
source: A responsive site that showcases various hobby projects
fr_fr: Un site réactif qui présente divers projets passe-temps.

# title_workspace-preference
source: WorkSpace preferences
fr_fr: Préférences d'espace de travail (numérique)

# description_workspace-preference
source: Scripts, tools and configurations to set-up my developer environment quickly
fr_fr: Des scripts, outils et configurations pour mettre en place mon environnement de développeur rapidement
